{"/about/":{"data":{"":"My name is Guillaume, I guess you could describe me as an introspective adventurer - someone who loves pushing both his body and mind. As a passionate endurance athlete, I find joy and meaning in cycling, running, and the daily pursuit of becoming a bit better than I was yesterday.\nI’m also deeply curious about how the world works. I find myself drawn to philosophy, economics, and the big questions around free will, consciousness, and human behavior. I enjoy challenging ideas and exploring different perspectives - not just to understand, but to grow.\nProfessionally, I work in business intelligence, supporting and leading teams, always looking for ways to improve systems and empower others. Personally, I value presence, quiet moments with loved ones, meaningful conversations, and a good laugh (which people say is pretty distinctive).\nI live mostly in the present, but trying to think a few steps ahead - whether it’s learning new things, refining my training, or designing a more intentional life. I guess you could say I like moving forward - just maybe a little slower, and with purpose."},"title":"Who I am?"},"/blog/20250619_klara_and_the_sun/":{"data":{"":"I recently finished reading Klara and the Sun by Kazuo Ishiguro and found it to be both a deeply moving and intellectually stimulating novel. Through the naive and observant gaze of Klara, an Artificial Friend (AF) designed to support children, Ishiguro explores a number of unsettling themes that are all the more powerful for being presented with such simplicity.\nThe world Klara inhabits is not too far removed from ours: children attend school remotely, socialization is scarce, and society is increasingly stratified by access to advanced technology. By following Klara as she tries to understand and help the sickly teenager Josie, the novel invites us to reflect on what it means to be human in a world shaped by genetic engineering, artificial intelligence, and the human need for meaning.","ai-and-the-temptation-of-immortality#AI and the Temptation of Immortality":"Another central theme is the role of artificial intelligence and its potential to serve as a vessel for immortality. As Josie’s illness worsens, her mother entertains the idea of creating an artificial replica of her daughter, using Klara as the base and transferring everything she learns about Josie into a synthetic copy.\nThis raises deeply uncomfortable questions. What makes someone who they are? Can a machine programmed with memories and behaviors ever truly replace a person?\nInterestingly, it’s Josie’s father, arguably the more technically literate character, who is most skeptical of the plan. He acknowledges that he might be able to rationally accept a copy of Josie, but doubts that anyone, especially the mother, would emotionally be able to do the same. There’s a tension here between rationality and emotional truth, just because something is technically possible doesn’t mean it is ethically or psychologically acceptable.\nKlara’s willingness to sacrifice herself in this plan adds another layer. She does not question whether it is right or wrong, only whether it will help Josie. It’s a haunting depiction of the utilitarian logic that might one day guide human-AI interactions.","belief-religion-and-the-limits-of-understanding#Belief, Religion, and the Limits of Understanding":"Finally, the novel touches on the human (and artificial) need for belief. Klara develops a form of solar worship, convinced that the sun, her source of energy, also has healing powers that might save Josie. She prays to it, negotiates with it, and performs rituals in its honor.\nFrom a rational perspective, this seems absurd. But for Klara, it provides a sense of agency and purpose. By attributing meaning to her observations, such as a homeless man “resurrected” after a night in the cold, she creates a framework to make sense of the world and her place in it.\nWhat struck me here is how closely this mirrors the origins of human religious belief. Faced with incomplete information and emotional uncertainty, both Klara and humans construct narratives that provide comfort and direction. In Klara’s case, her limited understanding of natural phenomena leads to conclusions that are logically flawed but emotionally coherent.\nThere’s also an ironic reversal: we often think of AI as hyper-rational and data-driven, yet Klara behaves more like a spiritually curious child. In reality, as AI grows more powerful, it will not learn about the world through naive sensory experience as Klara does, but through access to global information. Its limitations will be shaped not by observation, but by the biases we’ve embedded in the data we feed it.\nStill, the ambiguity remains. Josie does recover, and Klara believes it’s because of the sun. Was she right all along? Or was it just coincidence, another case of belief reinforced by luck?\nKlara and the Sun raises complex questions about where our society might be headed. Through its quiet narrative and gentle pacing, it encourages us to think critically about the consequences of our technological ambitions, and reminds us that behind every innovation lies a set of values and choices we can’t afford to ignore.","gene-editing-and-the-collapse-of-social-mobility#Gene Editing and the Collapse of Social Mobility":"One of the most striking elements of the story is the deep social divide caused by genetic modification. Some children are “Lifted”, a euphemism for being genetically enhanced to boost cognitive performance. Josie is lifted; Rick, her closest friend, is not.\nThe consequences of this binary status are severe. Lifted children have access to better education and future opportunities. In contrast, unmodified children are left with virtually no path to upward mobility. At one point, it’s mentioned that only a single university considers non-lifted candidates, and even then, they accept just 2%. The system is structurally rigged.\nWhat I found particularly interesting is how Ishiguro softens the notion that lifted children are objectively superior. In fact, both Josie and her late sister, who were lifted, suffer from health complications, hinting at unintended consequences of the procedure. Moreover, the supposed cognitive gap between lifted and non-lifted children appears relatively minor. Rick, for instance, is intellectually curious and technically skilled, capable of building drones and keeping up with Josie in complex social games. What truly sets him apart isn’t any lack of intelligence, but his lack of access.\nThis seems to be Ishiguro’s point: to benefit from an unfair system, you don’t need an actual advantage, just a socially constructed one. The real danger of gene editing in this context is not the enhancement itself, but how it reinforces inequality and erodes any remaining hope for merit-based mobility."},"title":"Klara and the Sun: Reflections on Technology, Inequality, and Belief"},"/blog/20250623_atomic_habits/":{"data":{"":"A few years ago, I stumbled upon a book that ended up shaping who I am today: Atomic Habits by James Clear. It didn’t just change how I think, it changed what I do, every single day.\nThis book helped me become more active and consistent in running, cycling, reading, and many other small routines that now shape my daily life. But more importantly, it shifted the way I think about change. It taught me that meaningful transformation doesn’t come from radical overnight overhauls, but from small, consistent, incremental improvements. Here’s a breakdown of some key ideas that stuck with me and how they’ve played a role in my own habits.","final-thoughts#Final Thoughts":"Atomic Habits wasn’t just a book I read, it became a framework I use daily. It helped me shift from vague goals to clear systems, from self-criticism to identity reinforcement, and from occasional motivation to consistent action.","identity-based-habits-become-the-kind-of-person-you-want-to-be#Identity-Based Habits: Become the Kind of Person You Want to Be":"One of Clear’s most powerful ideas is that we often get the habit loop backward. Most people start with a goal (“I want to run a marathon”) and then try to work backwards.\nInstead, Clear proposes starting with identity:\n“I’m the kind of person who runs regularly”\nrather than\n“I want to finish a race”\nThis shift had a huge impact on me. When I started cycling to work, I didn’t consider myself athletic. But the more I did it, the more I saw myself as someone who cycles. That identity shift made it easier to build other habits like running, strength training, and eventually completing several marathon and an Ironman 70.3.","long-term-gains-the-compounding-effect#Long-Term Gains: The Compounding Effect":"The idea of marginal gains hit home for me. Improving just 1% a day may seem small, but it compounds into something big. That’s why habits matter: they allow these small wins to happen automatically over time.\nBut it also works the other way. Neglecting small actions or falling into easy temptations can compound negatively. That awareness helps me stay intentional, even when the changes seem minor.","rediscovering-the-value-of-boredom#Rediscovering the Value of Boredom":"There’s a surprising idea in Atomic Habits that I keep coming back to: embrace boredom. Doing the same thing every day, even when it gets repetitive, is what leads to mastery.\nWhether it’s running in the same streets or writing in the same journal, progress comes from sticking with the process, even when it’s not exciting.\nAnd beyond that, I’ve also started carving out time to be intentionally bored. Disconnecting from screens and stimulation helps me think better, process what I’ve learned, and spark new ideas.","the-habit-loop-cue-craving-response-reward#The Habit Loop: Cue, Craving, Response, Reward":"Clear breaks down every habit into a four-step loop:\n1. Cue: Make it Obvious I started identifying my bad habits by mapping out my daily actions and rating them as good (+), neutral (=), or bad (-). Then I began using habit stacking: placing a new habit right after an existing one. For instance, I started doing strength training after my daily bike commute, turning a routine into a trigger.\n2. Craving: Make it Attractive What really struck me was that we crave not the reward itself but the anticipation. Just like when I research something I want to buy, I enjoy the search more than the purchase. Clear suggests surrounding ourselves with people who embody the habits we want. That’s been true for me. Just spending time with people who value health, consistency, or curiosity makes me more like them.\n3. Response: Make it Easy The 2-minute rule changed everything. I stopped over-optimizing and started showing up. Just doing a habit, even for 2 minutes, helps keep the momentum alive. “The better is the enemy of the good” became a mantra.\n4. Reward: Make it Satisfying We all crave instant gratification, but healthy habits often only pay off later. Creating a habit tracker helped me stay consistent. Even something as simple as checking off a box brings a small reward. And for me, accountability really works. Knowing that someone might ask me how things are going pushes me to stick with it.","the-importance-of-reflection#The Importance of Reflection":"Lastly, Clear emphasizes regular reflection to avoid the illusion of progress. Just because something feels easier doesn’t mean we’re actually getting better.\nI am now trying to build a routine of quarterly and yearly reviews, where I:\nMeasure progress (using habit trackers) Reflect on who I am now Decide who I want to become This practice helps me adjust course, stay aligned with my values, and keep growing.","why-habits-matter-the-power-of-automating-the-small-stuff#Why Habits Matter: The Power of Automating the Small Stuff":"Clear argues that habits are mental shortcuts, actions we repeat enough to perform without thinking. And that’s incredibly powerful. By automating the small things, we free up mental energy for what really matters.\nDecision Fatigue is Real Our brains can only make so many decisions in a day. The more we spend energy deciding what to eat, when to exercise, or how to structure our day, the less energy we have for deeper, more complex decisions.\nThis clicked for me when I realized how routines could clear mental clutter. Things like running in the morning or writing a quick daily note at the same time became effortless once I stopped leaving them up to daily decision-making."},"title":"How Atomic Habits Changed My Life"},"/blog/20250722_gfny_grand_ballon/":{"data":{"":"Today was a great milestone: I raced my first official bike race the GFNY Grand Ballon!\nI’ve done several running events, including three marathons, and multiple triathlons such as the Luxembourg Ironman 70.3. But until now, I had never taken part in a pure cycling race. I had always pushed the idea back, partly out of fear: fear of the mass start, fear of high-speed descents surrounded by other riders, and probably, fear of confronting my real limits as a cyclist.\nMost of my cycling until now has been comfortable. Not easy, because I have done several challenging 300+ km rides such as the lap of Mallorca or the Tour of Luxembourg, but it was always in relaxed environment with my friends, stopping when we felt like it. Those rides have always been about endurance, not intensity. Racing on steep climbs, my weakest terrain, felt intimidating.","final-push#Final Push":"\nAt the last aid station on the Grand Ballon, I downed some isotonic drinks and even ate salt packets, desperate times! That helped reduce the cramps, and I managed to push through the final 20 km: 15 km of descent and 5 km of flat(ish) road back to Thann.\nI crossed the finish line after 6 hours and 30 minutes, exhausted, proud, and humbled. Antoine and Steven finished 15 and 30 minutes ahead of me, and while I wish I could’ve competed with them more closely, I am happy I gave my best effort!","reflections#Reflections":"This race taught me more than I expected, not just about endurance, but about strategy, fueling, and preparation. I made a few key mistakes along the way, and I’m glad I did, because I won’t repeat them next time. Here are the biggest lessons I’m taking with me:\n1. Pace yourself at the start. At the beginning of a race, especially a mass start, it’s easy to get swept up in the adrenaline. You feel fresh, strong, and excited. But going too hard in the early climbs can burn matches you’ll need later. Trust your pacing plan and ride your own race. You’ll thank yourself on the final climb.\n2.\tDon’t underestimate hydration and fueling, especially on a hot day. I made the rookie mistake of skipping the first feed station to save a few minutes. That choice came back to haunt me in the form of cramps and fatigue during the last climbs. Even if you’re feeling good early on, use the feed zones to refill bottles and plan sufficient electrolytes on hot days.\n3.\tPre-race nutrition matters more than you think. I probably overdid the carbs the day before (hello, pizza) and didn’t eat enough fiber. It felt great in the moment, but it may have contributed to a frustratingly absent morning poop, which added a layer of discomfort on race day. In future races, I’ll aim for more balanced meals in the days leading up, including some fiber to keep things moving naturally.\nUntil next time, Vosges!","the-grand-ballon#The Grand Ballon":"\nAfter the first climb and a fast descent back to Thann, where riders passed me from both sides at lightning speed, we reached the most iconic climb of the day: the Grand Ballon d’Alsace. Around 1,000 meters of elevation at a steady 6%. I paced myself carefully, following my Garmin Power Guide, and reached the top after about an hour.\nThere was a food station at the summit, which I skipped thinking that I had enough water and would gain more time by pushing to the next feed station (mistake #3).","the-petit-ballon-and-beyond#The Petit Ballon and Beyond":"\nFrom there, the day became a blur of fast descents and rolling climbs until I reached the dreaded Petit Ballon. It’s “petit” only in name: around 750 meters of climbing, with punishingly irregular gradients and multiple steep sections above 10%. My legs started to feel very heavy and I was struggling to follow my planned power.\nA small relief came from the local residents spraying us with water hoses: an absolute lifesaver in the heat! Although… it also mixed with sweat, gels, and dirt on my sunglasses, blinding me for the next descent.\nDirectly after that descent came the last real climb of the day, a challenging (but lesser-known) climb of around 660 meters. I was happy it was the final real ascent of the day, until the cramps started. I had to stop twice to stretch, and I couldn’t push hard on the flatter sections which are usually my strong suit!","the-race-day#The Race Day":"\nThe race started at 7:45 AM, so we had to be at the starting point between 7:00 and 7:30. That meant waking up at 5:00 AM for a solid breakfast, coffee, and praying for a good poop (which, sadly, did not happen for me… Mistake #1).\nThe course began with a 250-meter elevation gain through the forest, a good way to spread out the peloton after the mass start. I tried to stay on Antoine’s wheel, but after 20 minutes at ~300 watts and a heart rate of 160–165 bpm (mistake #2), I realized I was going above my sustainable effort and decided to let him go. I settled into my own rhythm.\nTo my relief, the mass start was far less chaotic than I feared. I didn’t feel in danger, and the energy of the race was actually thrilling."},"title":"My First Real Bike Race – GFNY Grand Ballon 2025"}}